cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/homebrew-php'

brew 'ack'
brew 'archey'
brew 'coreutils'
brew 'git'
brew 'gh'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'openssl'
brew 'node'
brew 'readline'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'php70'

cask '1password'
cask 'alfred'
cask 'atom'
cask 'caffeine'
cask 'cd-to'
cask 'iterm2-beta'
cask 'firefox'
cask 'google-chrome'
cask 'opera'
cask 'firefox'
cask 'nvalt'
cask 'sequel-pro'
cask 'transmission'
cask 'transmit'
cask 'trim-enabler'
cask 'vlc'
cask 'imagealpha'
cask 'imageoptim'
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webp-quicklook'
cask 'istat-menus'
cask 'vmware-fusion'
cask 'harvest'
cask 'dash'
cask 'flux'
