# Use `brew bundle` to install the packages listed below

cask_args appdir: '/Applications'

# What's on tap?
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

# Install these packages >
brew 'ack'
brew 'archey'
brew 'coreutils'
brew 'git'
brew 'grc'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'node'
brew 'openssl'
brew 'readline'
brew 'spaceman-diff'
brew 'spark'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'z'
brew 'zsh'

# Install these Application via brew cask >
cask 'alfred'
cask 'caffeine'
cask 'cd-to'
cask 'dash'
cask 'firefox'
cask 'google-chrome'
cask 'imagealpha'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'nvalt'
cask 'opera'
cask 'rectangle'
cask 'screens'
cask 'sequel-pro'
cask 'spotify'
cask 'transmit'
cask 'ubersicht'

# Install these Quick Look plugins >
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

# Install these fonts via brew cask > 
cask 'font-hack-nerd-font'
cask 'font-source-code-pro'
